{
  "blockchain": "Blockchain technology, which originated in cryptographer David Chaum's 1982 dissertation, was fully described by Stuart Haber and W. Scott Stornetta in 1991 as a tamper-proof timestamp system for documents. Their invention laid the foundation for Satoshi Nakamoto's creation of Bitcoin in 2008, which combined public key cryptography, proof of work, and the blockchain concept.  In Bitcoin, public key cryptography provides secure transactions by replacing physical signatures with digital ones, enabling a pseudonymous environment. Proof of work involves miners competing to find a valid hash and verify transactions, which are added to the blockchain. This immutable, publicly validatable database stores transactions in sequential blocks, each referencing the previous one.  There are four main types of blockchain networks: public, private, consortium, and hybrid.  Public blockchains are open-access networks with no restrictions, allowing anyone to send transactions and participate in consensus protocols. They often offer economic incentives and typically use proof-of-stake or proof-of-work algorithms. Bitcoin and Ethereum are two well-known public blockchains.  Private blockchains are permissioned networks with restricted access, limited participant and validator access, and are commonly referred to as Distributed Ledger Technology (DLT).  Hybrid blockchains combine centralized and decentralized features, offering flexibility in control and accessibility.  Consortium blockchains blend public and private elements, where a group of organizations collaborates to create and operate the blockchain, jointly managing the network and validating transactions. Consortium blockchains are permissioned, granting access only to certain individuals or organizations. They are often used in industries like supply chain management and financial services, offering efficiency, scalability, security, and reliability. Quorum and Hyperledger are examples.  Sidechains are blockchain ledgers running parallel to primary blockchains, enabling independent operation while maintaining a connection to the main chain, allowing for alternate record-keeping methods or consensus algorithms.  Blockchain adoption has grown since 2016, particularly within financial services, with industry trade groups forming the Global Blockchain Forum. In 2018, only 1% of CIOs reported blockchain adoption, with 8% in the planning or active experimentation stage, while by 2019, 5% of CIOs believed blockchain technology was a game-changer for their businesses.  In summary, blockchain technology has evolved from Chaum's early proposal to Haber and Stornetta's cryptographic chain of blocks, culminating in Nakamoto's decentralized blockchain and Bitcoin implementation. Its adoption has steadily grown as its versatility, security, and potential applications continue to be explored and developed. The four main types of blockchain networks cater to different needs, offering various levels of control, access, and security, demonstrating the adaptability and potential of this groundbreaking technology. ",
  "bitcoin": "Bitcoin is a decentralized digital currency, created in 2009 by an anonymous person or group known as Satoshi Nakamoto. It uses a peer-to-peer network and relies on cryptography to secure transactions. Bitcoin transactions are recorded in a public ledger called the blockchain, which is maintained by a network of miners. These miners validate and confirm transactions through a process called Proof-of-Work (PoW), where they solve complex mathematical problems to create new blocks in the blockchain.  The total supply of Bitcoin is capped at 21 million coins. New bitcoins are created through a process called mining, where miners are rewarded with newly minted bitcoins and transaction fees for adding new blocks to the blockchain. The mining reward is halved approximately every four years, with the last bitcoin expected to be mined around 2140. After that, miners will only be rewarded with transaction fees.  Bitcoin's decentralization comes from its lack of central authority, peer-to-peer network, distributed ledger, public accessibility, and competitive nature of mining. However, there has been a trend towards centralization, with large mining pools controlling significant portions of the network's hashing power. China has also been a significant player, with over 70% of the hashing power and 90% of transactions operating from the country in 2017.  Bitcoin is pseudonymous, meaning that funds are not tied to real-world entities but to Bitcoin addresses. While transactions are public, they can be linked to individuals and companies through 'idioms of use' and other techniques. To enhance financial privacy, users can generate a new Bitcoin address for each transaction. Bitcoin's fungibility can be affected by the history of each coin, as users can refuse to accept coins from controversial transactions.  A Bitcoin wallet stores the digital credentials necessary to access and spend bitcoins. Wallets can be software-based, online, or utilize cold storage methods such as paper wallets and hardware wallets. Software wallets can be full clients or lightweight clients. Full clients download the entire blockchain, while lightweight clients rely on full nodes for transaction validation. Online wallets require trust in the wallet provider, as a security breach could result in stolen bitcoins.  Cold storage keeps private keys offline and inaccessible to hackers. Hardware wallets store private keys internally and sign transactions securely without exposing sensitive information. Paper wallets involve printing private keys on paper and storing them in a safe location. Physical wallets can also take the form of metal tokens with private keys accessible under a security hologram.  In conclusion, Bitcoin is a decentralized digital currency that relies on a peer-to-peer network and cryptography for security. Its supply is capped at 21 million coins, with mining rewards halving every four years. While decentralized, there are concerns of centralization in mining and potential privacy issues. Various types of wallets exist to store and manage bitcoins, each with its own security implications.",
  "arweave": "Arweave is a decentralized protocol enabling permanent data storage. It allows users to preserve data with a single, one-time fee, and is secured by a decentralized network of miners who store and replicate data in exchange for AR token rewards. The Arweave network is built upon a sustainable endowment, ensuring that data is always available and supported by a transparent and immutable risk model.  Arweave's permaweb is a decentralized web comprised of modular and interchangeable protocols, aiming to address the traditional web's lack of memory. The permaweb ensures that data and applications are replicated across the world perpetually. The base protocol is Arweave, which uses a scalable blockchain-like structure, a novel mining system, and a sustainable endowment to guarantee data availability and permanence. The permaweb is accessed via a decentralized network of gateway servers, making data easily accessible to web browsers without modification or specialized software.  Permaweb apps are decentralized applications hosted on the permaweb. They operate independently, governed by their own code, and can be used permissionlessly. These apps are resilient, with zero maintenance or upkeep costs to the original developer. The full stack for building these applications consists of Arweave (core data replication system), Gateways (content delivery servers), GraphQL (querying system), and SmartWeave (smart contracting system).  Profit Sharing Communities (PSCs) are decentralized governance structures that can be deployed in permaweb apps. PSCs enable the sharing of app-generated profit among builders, funders, and users. They also allow stakeholders to control and organize the application, voting on content moderation, featured content, and application upgrades.  Mining in Arweave revolves around the creation and testing of Succinct Proofs of Random Access (SPoRAs) during block production periods. The mining process consists of multiple phases, including generating a block, hashing the candidate block's metadata and a random number (nonce) using RandomX, determining the challenge byte, reading the challenge byte from the dataset, creating a Merkle proof, hashing the block metadata, Merkle proof, chunk, and nonce using RandomX, and validating the hash output against the network's difficulty level.  Arweave mining incentives include wide data replication, data replication auto-leveling, and sacrifice mining. Wide data replication encourages miners to store more data, increasing their chances of recalling the challenge byte and progressing in the mining process. Data replication auto-leveling incentivizes miners to store data that is less well-replicated in the network, rewarding those who access rare data with higher SPoRA rates. Sacrifice mining allows miners to gain an advantage by committing data they do not share, increasing their relative SPoRA rate and adding a layer of economic security.  In summary, Arweave is a decentralized protocol for permanent data storage, which features a permaweb hosting decentralized applications, profit sharing communities, and an innovative mining process. Arweave's mining incentives promote wide data replication, data storage optimization, and economic security within the network.",
  "livepeer": "Livepeer is a decentralized video streaming network built on the Ethereum blockchain, providing a scalable, cost-effective, and accessible solution for video streaming and transcoding. It employs a delegated proof-of-stake (DPoS) consensus mechanism, allowing token holders to delegate tokens to orchestrators who transcode video into multiple formats and bitrates.  To use Livepeer, users download the software and set up a node. There are three node types: broadcaster, orchestrator, and transcoder. Broadcasters ingest video streams and send them to orchestrators, who coordinate transcoding and distribute rewards to delegators. Transcoders perform the actual transcoding work.  Livepeer's native token, LPT, can be mined by running a node. LPT is staked to participate in the network, secure it, and earn rewards. Users can run a mining node on the Arbitrum network, an Ethereum layer 2 scaling solution, which reduces fees and latency.  To mine LPT, users run the Livepeer binary with flags like -ethUrl, -ethAcctAddr, -orchestrator, and -transcoder. If users lack an Ethereum account, the software creates one and prompts for a passphrase. The private key and passphrase must be securely stored.  Activating an orchestrator requires staking LPT. The active orchestrator set includes the top 100 orchestrators with the most LPT stake. Users can activate their orchestrator using the livepeer_cli tool and set parameters like block reward cut percentage, fee cut percentage, price per unit, and service address.  Orchestrators can use the MerkleMine algorithm for an initial LPT allocation. The algorithm allows calling the 'generate' function on the MerkleMine smart contract with a valid address and a Merkle proof. Users can obtain the Merkle proof using the Livepeer Token distribution dApp or the MerkleMine client.  Livepeer supports building Video on Demand (VOD) with Access Controls, enabling developers to gate on-demand content using webhooks. The process involves five steps: creating an Access Control Webhook Handler, registering the webhook, creating an asset with a playback policy webhook, configuring the player with an access key, and receiving the webhook from Livepeer to grant or deny access to the VOD asset.  To create an Access Control Webhook Handler, users set up an endpoint (e.g., https://yourdomain.com/api/check-access) to handle granting or denying access to VOD assets. This endpoint accepts a POST request with a JSON payload containing the access key and webhook context. Next, register an Access Control Webhook using the Livepeer Studio dashboard, specifying the URL of the access control endpoint.  When creating an asset with a playback policy webhook, users pass the ID of the webhook created in the previous step. Asset creation can be done using the useCreateAsset function provided by the @livepeer/react package. The player can then be configured with an access key, passed to the webhook to verify its validity. If the player isn't being used, the access key can be manually appended to the m3u8 URL as a query parameter.  When a user attempts to access the VOD asset, Livepeer calls the access control endpoint with the access key and webhook context. The endpoint processes the request and returns a response indicating whether stream access should be allowed or disallowed. This feature can be used for streams as well.",
  "akash": "decentralized☁️, buy/sell💻resources🔐&💹. Define📄(Docker🖼️,CPU🔋,memory🧠,storage💾)+SDL. Set💰, get bids💼. Marketplace🏪: requests, bids, leases, AKT🪙. Container Platform🚀: host/manage📦, cloud-native apps🌐. Cost💲: ~1/3 AWS, GCP, Azure💸. Utilize🌍data centers💻, no vendor lock🔓. Networking🌐: SDL🔧. Update⚙️some attributes w/o closing deployments🔄",
  "proof of work": "Why mine bitcoin?  To potentially earn bitcoin block rewards (6.25 bitcoins as of April 2023). To participate in securing and maintaining the decentralized Bitcoin network. Bitcoin miners discover new blocks by competing with each other using specialized computing equipment to generate fixed-length codes known as 'hashes.' Miners must find a hash with an equal or higher number of zeros in front of it than the 'target hash.' They change a 'cryptographic nonce' in the previous block header data to generate different hashes. Mining requires energy-intensive computers, particularly application-specific integrated circuit (ASIC) miners, which can generate trillions of hashes per second.  Bitcoin mining rewards: For every new block added to the blockchain, miners receive a fixed amount of newly minted coins. Block rewards decrease roughly every four years, or 210,000 blocks, in a process called 'Bitcoin Halving.' The current block reward is 6.25 BTC. Once 21 million BTC is released, miners will only earn rewards in the form of bitcoin transaction fees.  To increase their chances of profit, miners can join 'mining pools,' where they share rewards according to each miner's contribution. However, mining profitability is limited by electricity and hardware costs, especially for miners with limited resources.  Bitcoin mining difficulty: The Bitcoin protocol adjusts mining difficulty every two weeks to keep block discovery times as close to 10 minutes as possible. If blocks are discovered too quickly or slowly, the protocol adjusts the target hash, making it harder or easier for miners to find blocks.  Bitcoin mining energy consumption: Bitcoin mining consumes vast amounts of energy due to the high computational power required for mining new coins. The Cambridge Bitcoin Electricity Consumption Index (CBECI) estimates that Bitcoin consumes approximately 131 TeraWatt hours (TWh) of electricity per year. This high energy consumption is a significant drawback of Bitcoin mining. Why Proof of Work & ASICs are a good thing - from ASICS & Decentralization FAQ by Poelstra Proof of work (PoW) consensus has thermodynamic limits, creating incentives against centralization due to cooling costs. However, economies of scale in electrical production can encourage centralization. ASICs bring mining closer to thermodynamic limits, benefiting decentralization and reducing environmental impact. ASIC resistance increases algorithmic complexity, leading to manufacturing centralization and slower proof validation, which negatively impacts decentralization.  Memory-hardness increases ASIC board footprint and capital costs, encouraging centralization. Scrypt is slower to validate, more complex, and more memory-hard than SHA2, making it less desirable. Primecoin is slower to validate, more complex, and uses an ad-hoc algorithm with no guarantees of being progress-free, approximation-free, or optimization-free.  Proof of stake (PoS) aims to consume the cryptocurrency itself for consensus, rather than relying on energy-intensive mining. However, PoS faces the 'nothing at stake' problem, where there is no cost for users to vote on multiple blockchain forks, leading to a tragedy of the commons. This issue is fatal for centralization and consensus in PoS systems. PoS can be useful for creating innovative protocols, but it cannot be used to create distributed consensus.",
  "the graph": "The Graph is a decentralized protocol for indexing and querying data from blockchains, providing a scalable and reliable way to access blockchain data through APIs called subgraphs. It leverages GraphQL, a query language for APIs that facilitates data retrieval. The Graph aims to reduce reliance on centralized data sources and improve the development of decentralized applications (dApps). GRT is the native token used for incentivizing network participants, including Indexers, Delegators, Curators, and Subgraph Consumers. The initial supply of GRT is 10 billion, with an annual issuance of 3% to reward Indexers. Approximately 1% of the GRT supply is burned annually through various activities, including a 0.5% delegation tax and a 1% curation tax. An Indexer's self-stake is slashed by 2.5% if found guilty of malicious behavior, with half of this amount being burned. Indexers are the backbone of the network, operating hardware and software to index data and serve GraphQL queries. They stake GRT as collateral and earn query fees and indexing rewards. Indexers are rewarded based on their allocated stake on subgraphs and the amount of curation signal. Delegators secure the network by delegating GRT to Indexers, increasing the latter's stake. In return, they earn a share of query fees and indexing rewards. Delegation incurs a 0.5% tax, and withdrawal requires a 28-epoch unbonding period (~26 days). Curators identify high-quality subgraphs and signal GRT on them, earning curation shares and a percentage of future query fees. Subgraph developers often curate their subgraphs, and as of December 2022, they are encouraged to signal at least 10,000 GRT. Developers build and query subgraphs, which are custom APIs that can be deployed to The Graph's decentralized network. They pay for queries in GRT, which is distributed among network participants. Subgraphs are open source, enabling other developers to access the same data. Subgraph Studio is a dApp for building, deploying, and publishing subgraphs. Graph Explorer helps participants explore subgraphs and interact with the protocol. Graph CLI is a command-line interface tool for deploying to The Graph. The network has an economic security measure called the Rebate Pool that holds query fees until they can be claimed by Indexers. An Epoch is a unit of time in the network, equivalent to 6,646 blocks or approximately 1 day. Fishermen and Arbitrators play important roles in the network. Fishermen dispute Indexers' query responses and POIs, ensuring data accuracy. If a dispute is resolved in their favor, the Indexer is penalized, and the Fisherman receives a reward. Arbitrators decide the outcome of disputes and aim to maximize the utility and reliability of The Graph Network. In conclusion, The Graph is a decentralized protocol for indexing and querying blockchain data, serving as an essential infrastructure for the development of dApps. Its native token, GRT, provides economic incentives for various network participants, ensuring the network's security, stability, and growth."
}
